<?php

namespace Tests\Feature\Hepler;

use Tests\TestCase;

class CronForHumanTest extends TestCase {
  
  public function test_cron_expression_for_human () {
    $asserts = [
      ["* * * * * ", "毎分"],
      ["*/2 * * * * ", "2分毎"],
      ["1,55 * * * * ", "毎時1と55分"],
      ["1,12,55 * * * * ", "毎時1,12と55分"],
      ["15-30 * * * * ", "毎時15分から30分まで"],
      ["15-30/2 * * * * ", "2分毎15分から30分まで"],
      ["* 1 * * * ", "毎分,01:00-01:59時分まで"],
      ["* 1,23 * * * ", "毎分,毎01:00と23:00"],
      ["* 9-18 * * * ", "毎分,09:00-18:59時分まで"],
      ["* 9-18/3 * * * ", "毎分,3時間おき,09:00-18:59時分まで"],
      ["* 9,12,15 * * * ", "毎分,毎09:00,12:00と15:00"],
      ["* 9,12,15,18 * * * ", "毎分,毎09:00,12:00,15:00と18:00"],
      ["30 12 * * * ", "毎12:30"],
      ["30,59 12 * * * ", "毎時30と59分,毎12:00"],
      ["30 12 1 * * ", "毎12:30,毎月1日"],
      ["30 12 1,2 * * ", "毎12:30,毎月1と2日"],
      ["30 12 1,2,3 * * ", "毎12:30,毎月1,2と3日"],
      ["30 12 15-25 * * ", "毎12:30,毎月15-25日"],
      ["30 12 1,*/5 * * ", "毎12:30,毎月1日と毎月5の日ごと"],
      ["30 12 * 1,2,3 * ", "毎12:30,1月,2月と3月"],
      ["30 12 * 5-6 * ", "毎12:30,5月から6月まで"],
      ["30 12 * 4,5,6 1-7 ", "毎12:30,月曜から日曜まで,4月,5月と6月"],
      ["1 */2 * * * ", "毎時1分,2時間おき"],
      ["5 0 * 8 *", "毎00:05,8月"],
      ["15 14 1 * *", "毎14:15,毎月1日"],
      ["0 22 * * 1-5", "毎22:00,月曜から金曜まで"],
      ["23 0-20/2 * * *", "毎時23分,2時間おき,00:00-20:59時分まで"],
      ["5 4 * * sun", "毎04:05日曜"],
      ["0 0,12 1 */2 *", " 00:00と12:00,毎月1日毎年2の月ごと"],
      ["0 4 8-14 * *", "毎04:00,毎月8-14日"],
      ["0 0 1,15 * 3", "毎00:00,毎月1と15日の水曜"],
      ["*/5 * 1,23 * 1-2", "5分毎,毎月1と23日,月曜から火曜まで"],
      ["0 11 1,23 * 1-2", "毎11:00,毎月1と23日,月曜から火曜まで"],
    ];
    
    foreach ( $asserts as $idx => $data ) {
      $result = cron_expression_for_human( $data[0] );
      $this->assertEquals( $data[1], $result );
    }
  }
}
